# Ζητάμε αριθμό από τον χρήστη
number = int(input("Give me a number: "))

#πανω μερος
for i in range(number // 2 + 1):
   spaces = " " * (number // 2 - i)
   stars = "* " * (i + 1)
   print(spaces + stars)

# Δημιουργούμε το κάτω μέρος του ρόμβου
for i in range(number // 2 - 1, -1, -1):  # Βρόχος που επαναλαμβάνεται για κάθε επίπεδο του κάτω μέρους
    spaces = " " * (number // 2 - i)  # Υπολογίζουμε τα κενά για τη συγκεκριμένη γραμμή
    stars = "* " * (i + 1)  # Υπολογίζουμε πόσα αστεράκια χρειάζονται
    print(spaces + stars)  # Εμφανίζουμε τη γραμμή με κενά και αστεράκια